@extends('layouts.app')

@section('content')
<div class="col-12">
    <h1 class="page-title">Let's start</h1>

    @php
        $raw_data = '<p>တနင်္ဂနွေ - အဆင်မပြေမှုတွေ များတတ်တဲ့နေ့ ဖြစ်ပြီး အကြံအစည်၊ ရည်ရွယ်ချက်တွေလည်း လွဲချော်လိမ့်မယ်။ အကြီးအကဲတွေနဲ့ မသင့်မမြတ် ဖြစ်တတ်သလို ကိုယ်တိုင်ကလည်း ခေါင်းမာတာ၊ တယူသန်တာတွေ များမယ်။ အလုပ်မှာ အဆင်ပြေပေမယ့် တာဝန်ကြီးတွေ ထမ်းရတတ်တယ်။ မနိုင်ဝန်တွေ လုပ်ရသလို ပင်ပန်းရလိမ့်မယ်။ ဒါပေမယ့် ဝင်ငွေကိစ္စ ကံကောင်းမယ်။ ရလမ်းတစ်ခုမက ပေါ်လာမယ်။ နှလုံးသားရေးကံဇာတာပါ ကောင်းမယ်။ ဒီနေ့ ညနေ ၄ ခွဲနဲ့ ၅ ကြား ကံကောင်းချိန် ဖြစ်တယ်။ ယတြာအနေနဲ့ ဦးထုပ်ဟောင်း၊ ထီးစုတ်တွေ စွန့်ပစ်ပေးပါ။</p>

        <p>ညံ့</p>

        <p>တနင်္လာ - စိတ်ချမ်းသာကိုယ်ချမ်းသာမှု ရမယ့်နေ့ဖြစ်တယ်။ ပျော်စရာရွှင်စရာတွေလည်း မကြာခဏ ကြုံရမယ်။ အလုပ်အကိုင်တွေ ကောင်းသလို အကျိုးအမြတ်လည်း အတော်အတန် ရမယ်။ ဒါပေမယ့် ကိုယ့်ကိစ္စမဟုတ်တာ သူများပြဿနာတွေထဲ ဝင်ပါမိလို့ ခံရတတ်တယ်။ အလုပ်ပိုတွေ၊ တာဝန်ပိုတွေ မယူတာ ကောင်းမယ်။ ငွေကြေး လာဘ်လာဘ ရွှင်မယ်။ စိတ်များတတ်လို့ အခွင့်ကောင်းနဲ့ လွဲတတ်တယ်။ အသက်ကြီးသူတွေနဲ့ အငြင်းပွားစရာ ဖြစ်တတ်တယ်။ အချစ်ရေး၊ အိမ်ထောင်ရေးမှာလည်း ဘာမဟုတ်တာလေးနဲ့ အငြင်းအခုံတွေ ဖြစ်ရတတ်တယ်။ ဒီနေ့ မနက် ၁၁ ခွဲနဲ့ ၁၂ ကြား ကံကောင်းချိန် ဖြစ်တယ်။ ယတြာအနေနဲ့ ဘုရားမှာ သစ်သီးဖျော်ရည် ကပ်ပေးပါ။</p>

        <p>ကောင်း</p>

        <p>အင်္ဂါ - ဒီနေ့မှာ ကျန်းမာရေး ပုံမှန်ထက် ကျဆင်းတတ်တယ်။ နေမကောင်းထိုင်မကောင်းတွေ ထဖြစ်တတ်သလို ရောဂါအခံ ဝေဒနာအခံ ရှိသူတွေဆိုရင်လည်း ဂရုစိုက်ရလိမ့်မယ်။ မောတာ၊ ကျပ်တာတွေ ခံစားလာရနိုင်တယ်။ အလုပ်ကိစ္စမှာ ပေးဆပ်သလောက် ပြန်မရတာ၊ အကျိုးအမြတ် နည်းတာတွေ ကြုံရတတ်တယ်။ အကျိုးစီးပွားကံ အားနည်းလို့ အရာမထင် ဖြစ်တတ်တယ်။ ဒါပေမယ့် မိတ်ဆွေကောင်း၊ အသိုင်းအဝိုင်းကောင်းရဲ့ ကူညီဖေးမမှု ရတတ်တယ်။ မေတ္တာရေးမှာ ကတောက်ကဆ ဖြစ်စရာတွေ များမယ်။ တကျက်ကျက်နဲ့ ဆူဆူပူပူတွေ ဖြစ်မယ်။ ဒီနေ့ ညနေ ၄ နဲ့ ၄ ခွဲကြား ကံကောင်းချိန် ဖြစ်တယ်။ ဘုရားမှာ ဒိန်ချဉ်တစ်ခွက် ကပ်လှူပြီး ဆုတောင်းပေးပါ။</p>

        <p>သင့်</p>

        <p>ဗုဒ္ဓဟူး - အလုပ်အကိုင်ကိစ္စ အခက်အခဲတွေ များတတ်တယ်။ လူယုံက ဒုက္ခပေးတာ၊ ကျောချမှ ဓားပြမှန်းသိပြီး ခံရတာတွေ ဖြစ်တတ်တယ်။ ငွေကြေးစီးပွားကံဇာတာ အားနည်းလို့ သတိထားလုပ်ရမယ်။ ငွေအတွက် ရန်များ စကားများ ဖြစ်ရလိမ့်မယ်။ ကိုယ်ရေးကိုယ်တာကိစ္စမှာလည်း စိတ်ပျက်လက်ပျက်စရာတွေ ဖြစ်မယ်။ မကျန်းမမာ ဖြစ်တတ်တယ်။ အချစ်ရေး၊ အိမ်ထောင်ရေးမှာတော့ သစ္စာတည်ဖို့ ခက်မယ်။ စိတ်ရှုပ်ထွေးစရာတွေ ဖြစ်ရမယ်။ ဒီနေ့ မနက် ၉ ခွဲနဲ့ ၁၀ ကြား ကံကောင်းချိန် ဖြစ်တယ်။ ယတြာအဖြစ် ဘုရားစင်မှာ သန့်ရှင်းရေး လုပ်ပေးရမယ်။</p>

        <p>ညံ့</p>

        <p>ရာဟု - ဟိုအရင်က ပြဿနာဟောင်းတွေက ကိုယ့်ဆီ တကျော့ပြန်လာတတ်တယ်။ မျက်နှာပျက်စရာကိစ္စတွေ အားနာစရာ၊ မျက်နှာပူစရာကိစ္စတွေနဲ့ရင်ဆိုင်တိုးရတတ်တယ်။ အမှားကို အမှန် ထင်တတ်လို့ တစ်နေ့တာလုံး သတိထား ဖြတ်သန်းရမယ်။ လူလိမ်လူကောက်တွေနဲ့လည်း ကြုံဆုံရတတ်တယ်။ အလုပ်မှာ စိတ်မပါလက်မပါ ဖြစ်တတ်တယ်။ ငွေကြေးအကျိုးအမြတ် နည်းပါးလိမ့်မယ်။ နှလုံးသားရေးမှာတော့ စိတ်ချမ်းသာစရာ ဖြစ်မယ်။ ဒီနေ့ ညနေ ၃ နဲ့ ၃ ခွဲကြား ကံကောင်းချိန် ဖြစ်တယ်။ ယတြာအဖြစ် အိမ်ခြေရာမဲ့တွေကို စားစရာ လှူဒါန်းပေးပါ။</p>

        <p>ညံ့</p>

        <p>ကြာသပတေး - ကိုယ့်အတွက်ရော သူများအတွက်ပါ စိတ်ပူပန်စရာတွေ များတတ်တယ်။ လူမှုရေးအလုပ်တွေနဲ့ အချိန်ကုန်လူပန်း ဖြစ်ရတတ်တယ်။ တစ်နေ့တာ အလုပ်တွေတော့ အဆင်ပြေတာများမယ်။ ငွေကြေးအရလည်း စိတ်ကျေနပ်မှု ရှိမယ်။ အများနဲ့ ပူးတွဲလုပ်တာတွေမှာ ကံကောင်းတတ်တယ်။ စပ်တူအကျိုးတူတွေ လုပ်ကိုင်လို့ အဆင်ပြေ အောင်မြင်နိုင်တယ်။ ဒါပေမယ့် ကျန်းမာရေးတော့ နည်းနည်း ညံ့တတ်တယ်။ အစားအသောက်တွေ သတိထားရမယ်။ အချစ်ရေး၊ အိမ်ထောင်ရေး ကံကောင်းနိုင်တယ်။ လူငယ်လူရွယ်တွေအဖို့ ပျော်စရာ ဖြစ်မယ်။ ဒီနေ့ နေ့ခင်း ၂ နဲ့ ၂ ခွဲကြား ကံကောင်းချိန် ဖြစ်တယ်။ ဘုရားမှာ သကြားဖြူးဆွမ်းကပ်လှူပြီးတော့ ယတြာပြုပါ။</p>

        <p>ကောင်း</p>

        <p>သောကြာ - မိတ်ဆွေအပေါင်းအသင်းတွေရဲ့ ကူညီဖေးမမှုတွေ ရမယ်။ အလုပ်အကိုင် အကြံအစည်တွေလည်း အောင်မြင်ဖို့ ရှိတယ်။ ဒါပေမယ့် အများနဲ့တွဲလုပ်တဲ့ အလုပ်တွေ၊ အစုရှယ်ယာတွေမှာတော့ ထိခိုက်တတ်တယ်။ မိသားစုအရေး ပူပန်စရာတချို့ ရှိလာနိုင်တယ်။ အကြီးအကဲတွေနဲ့ မသင့်မမြတ် ဖြစ်တတ်တယ်။ မိသားစုထဲမှာ စိတ်ဝမ်းကွဲစရာတွေ ဖြစ်တတ်တယ်။ ငွေရေးကြေးရေးမှာ ကံကောင်းမယ်။ ရလာရင်လည်း များများစားစားတွေ ရလာတတ်တယ်။ မေတ္တာရေးကံ အားနည်းတယ်။ သည်းညည်းမခံနိုင်စရာတွေ ဖြစ်မယ်။ သတိထားသင့်တယ်။ ဒီနေ့ မနက် ၇ ခွဲနဲ့ ၈ ခွဲကြား ကံကောင်းချိန် ဖြစ်တယ်။ ယတြာအဖြစ် ဘုရားမှာ သံပရာရည် ကပ်လှူပေးရမယ်။</p>

        <p>ကောင်း</p>

        <p>စနေ - သွားရေးလာရေးကိစ္စ၊ ခရီးကိစ္စတွေ အဆင်မပြေ ဖြစ်တတ်တယ်။ အလုပ်မှာလည်း တခါတည်းနဲ့ မပြီးဘဲ ထပ်တလဲလဲ လုပ်ပေးရတတ်တယ်။ ဒါပေမယ့် ဘယ်လိုတွေ အခက်အခဲ ဖြစ်ဖြစ် ဒီနေ့မှာ ကိုယ့်ရဲ့အစွမ်းအစနဲ့ ဖြေရှင်းနိုင်မယ်။ အကြံကောင်းဉာဏ်ကောင်းတွေလည်း ပေါ်လာတတ်တယ်။ မိတ်ဆွေတွေ အားကိုးတာထက် ကိုယ့်ဖာသာ ရုန်းကန်တာ ပိုကောင်းမယ်။ ငွေဝင်ပေမယ့် မမြဲဘဲ ဖြစ်မယ်။ နှလုံးသားရေးမှာ စိတ်ပူပန်နေရမယ်။ ဒီနေ့ နေ့ခင်း ၁ နဲ့ ၁ ခွဲကြား ကံကောင်းချိန် ဖြစ်တယ်။ ပဋ္ဌန်းအကျဉ်းကို ၁၀ ခေါက် ရွတ်ဖတ် ကုသိုလ်ယူပေးပါ။</p>

        <p>သင့်</p>

        <p>#lotaya_horoscope</p>

        <p><strong>MPT4U မှတစ်ဆင့် လိုတရ၏ အသစ်သစ်သော ဗေဒင်ဟောစာတမ်းများကို ဘေလ်မကုန် ၊ ဝန်ဆောင်ခပေးစရာမလိုဘဲ ဆက်လက်ဖတ်ရှုလို့ရသေးတယ်နော်။ </strong></p>

        <p><a href="https://lotaya.mpt.com.mm/event/263">ဒီလင့်ကိုနှိပ်ပြီ MPT4U Application ကို ဒေတာအခမဲ့ဖြင့် ဒေါင်းလုဒ်လုပ်နိုင်ပါပြီ။</a></p>

        <p><img src="https://static.lotayamm.com/upload/images/1440-x-330%20(3).png" /></p>';

        // for indexing ============================================
        // echo $raw_data;
        // $array = [];


        // $array_text = explode("</p>", $raw_data);
        // foreach ($array_text as $value) {
        //     if (strpos($value, '<a'))
        // }
        // print_r('<pre>');
        // print_r($array_text);
        



        // foreach ($array_text as $item) {
        //     array_push($array, $item);
        // }

        // $xml = simplexml_load_string($raw_data, 'SimpleXMLElement', LIBXML_NOCDATA);
        // echo "<pre>";
        // // print_r(strip_tags($xml->channel->item->description, ['img']));
        // print_r(strip_tags($xml->channel->item->description, ['img']));
        // echo "</pre>";

        // $get_data = new SimpleXMLElement($raw_data);
        // $real_data = $get_data->channel[0]->item[0]->description;
        // echo $raw_data;
        // strip_tags($raw_data, ['img']);
        // echo str_replace("<p>&nbsp;</p>", "", strip_tags($raw_data, ['p']));

        // dd($get_data->channel);

        // $rss = simplexml_load_string($raw_data);
        // dd($rss->channel->item[0]->description);
        // for ($n = 0; $n == count($rss->channel->item); $n++) {
        //     echo "<p>" . $item[$n] . "</p>";
        // }
        // foreach ($rss->channel->item as $item) {
        //     echo "<p>" . $item[0] . "</p>";
        // }


        // $rss = new domDocument;
        // $rss->loadXML($raw_data);
        // $xx = simplexml_import_dom($rss);
        // dd($xx->description);
    @endphp
</div>
@endsection
